{
  "images": [
    "images/IMG-20250824-WA0311.jpg",
    "images/IMG-20250618-WA0243.jpg",
    "images/IMG-20250824-WA0336.jpg",
    "images/IMG-20250618-WA0241.jpg",
    "images/IMG-20250618-WA0244.jpg",
    "images/IMG-20250618-WA0240.jpg",
    "images/IMG-20250825-WA0011.jpg",
    "images/IMG-20250825-WA0009.jpg",
    "images/IMG-20250825-WA0007.jpg",
    "images/IMG-20250825-WA0008.jpg", 
    "images/IMG-20250825-WA0010.jpg", 
    "images/WhatsApp Image 2025-08-25 at 08.34.49_1a478abf.jpg",
    "images/WhatsApp Image 2025-08-24 at 15.56.47_74c2fe08.jpg",
    "images/IMG-20250618-WA0245.jpg", 
    "images/IMG-20250618-WA0247.jpg",
    "images/IMG-20250828-WA0020.jpg",
    "images/IMG-20250828-WA0021.jpg",
    "images/IMG-20250828-WA0022.jpg",
    "images/IMG-20250828-WA0023.jpg",
    "images/IMG-20250828-WA0024.jpg",
    "images/IMG-20250828-WA0025.jpg",
    "images/IMG-20250828-WA0026.jpg",
    "images/IMG-20250828-WA0027.jpg",
    "images/IMG-20250828-WA0028.jpg",
    "images/IMG-20250828-WA0029.jpg",
    "images/IMG-20250828-WA0030.jpg",
    "images/IMG-20250828-WA0031.jpg",
    "images/IMG-20250828-WA0032.jpg",
    "images/IMG-20250828-WA0033.jpg",
    "images/IMG-20250828-WA0034.jpg",
    "images/IMG-20250828-WA0035.jpg",
    "images/IMG-20250828-WA0036.jpg",
    "images/IMG-20250828-WA0037.jpg",
    "images/IMG-20250828-WA0038.jpg",
    "images/IMG-20250828-WA0039.jpg",
    "images/IMG-20250828-WA0040.jpg",
    "images/IMG-20250828-WA0041.jpg",
    "images/IMG-20250828-WA0042.jpg",
    "images/IMG-20250828-WA0043.jpg",
    "images/IMG-20250828-WA0044.jpg",
    "images/IMG-20250828-WA0045.jpg",
    "images/IMG-20250828-WA0046.jpg",
    "images/IMG-20250828-WA0047.jpg",
    "images/IMG-20250828-WA0048.jpg",
    "images/IMG-20250828-WA0049.jpg",
    "images/IMG-20250828-WA0050.jpg",
    "images/IMG-20250828-WA0051.jpg",
    "images/IMG-20250828-WA0052.jpg",
    "images/IMG-20250828-WA0053.jpg",
    "images/IMG-20250828-WA0054.jpg",
    "images/IMG-20250828-WA0055.jpg", 
    "images/IMG-20250828-WA0056.jpg"
  ],

  "books": [
    { 
      "title": "Stories From the Dream Land", 
      "year": 2006, 
      "image": "images/storiesfromthedreamland.jpg",
      "description": "There are so many kinds of dream that either excite us or annoy us. Some dreams even scare us. Some dreams come true because it is destined that they do so. Some are very interesting but impossible because they may never come true, thus remaining at the level of desire. Ironically, the “sweet dreams” are often preferred, even when they are illogical and impossible. But there are certain dreams that we quickly forbid and attribute to an evil spirit or evil omen. If you are experiencing any of these, do not worry, you are simply in the dreamland. At daybreak, you will wake from sleep and happily return to our existential world of reality. The stories you shall read in this book are true-life stories presented in the form of dreams. They are neither real nor fiction. Not real because they have no true characters, not fiction because they happen everyday in our existential life.",
      "link": "https://amzn.eu/d/gazwH12"
    },
    { 
      "title": "Crisis of Morality Among Youths", 
      "year": 2007, 
      "image": "images/crisisofmorality.jpg",
      "description": "The crisis of choice making especially as it pertains to moral issues, ‘to be or not to be, to do or not to do,’ is not just restricted to any category of persons, like the youth. However, it could be said and rightly so, that the youth occupy the center stage of the people harassed by indecision, wrong decision, right decision, or the outright crisis of what to do or not to do. This is the moral crossroad! This book is fully packed with didactic practical stories that would engage you in a web of moral thoughts.",
      "link": "https://amzn.eu/d/03tN1oa"
    },
    { 
      "title": "Stories From the Dream Land (Vol.2)", 
      "year": 2008, 
      "image": "images/storiesfromthedreamland2.jpg",
      "description": "A collection of short stories that delve into the realm of dreams, imagination, and the subconscious mind. Each story explores different themes and emotions, offering readers a glimpse into fantastical worlds and thought-provoking scenarios.",
      "link": "https://amzn.eu/d/gFja0kq"
    },
    { 
      "title": "Love at First Sight", 
      "year": 2012, 
      "image": "images/loveatfirstsight.jpg",
      "description": "Love is never as simple as many would think or believe. It is a bit more complicated than that. It is like a two-edged sword that can build as well as destroy, that can give joy as well as an excruciating pain. The same love that gives meaning and joy to life has also been seen to be the cause of pain and heartbreaks to so many. So many promising relationships and marriages have collapsed due to sudden dry-up of what was thought to be love. WHY? The reason most often than not is what one would consider as “Love at first sight”syndrome.This is when people (especially youths) fall in love at first encounter mostly due to physical attractions, only to find out later that ‘all that glitters is not gold.’ In this easy reading book, the author really questions whether there is such a thing as love at first sight, is it just ‘a myth or a reality?’ The search for the answer to this question leads the reader into different practical but captivating stories that reveal the reality of the topic of love. This book is both interesting and inspirational, but most importantly very educating.",
      "link": "https://amzn.eu/d/5vQ1Mo7" 
    },
    { 
      "title": "Geschichten von dem Traumland Volume 1", 
      "year": 2019, 
      "image": "images/Geschichten1.jpg",
      "link": "https://amzn.eu/d/1i9ZZoD",
      "description": "Es gibt so viele Arten von Träumen, die uns entweder aufregen oder ärgern. Manche Träume machen uns sogar Angst, und dieser Traum von mir ist nur einer der Träume, die man als aufregend bezeichnen könnte. Manche Träume gehen in Erfüllung, weil es vorherbestimmt ist, dass sie in Erfüllung gehen. Manche sind sehr interessant, aber unmöglich, weil sie vielleicht nie in Erfüllung gehen und somit auf der Ebene des Wunsches bleiben. Ironischerweise werden die 'süßen Träume' oft bevorzugt, auch wenn sie unlogisch und unmöglich sind. Es gibt jedoch bestimmte Träume, die wir schnell verbieten und einem bösen Geist oder einem bösen Omen zuschreiben. Wenn Sie einen dieser Träume erleben, machen Sie sich keine Sorgen, du befindest sich einfach im Traumland. Bei Tagesanbruch werdest du aus dem Schlaf erwachen und glücklich in unsere existentielle Welt der Realität zurückkehren." 
    },
    { 
      "title": "Geschichten von dem Traumland Volume 2", 
      "year": 2020, 
      "image": "images/Geschichten2.jpg",
      "link": "https://amzn.eu/d/dDPLZbT",
      "description": "Es gibt so viele Arten von Träumen, die uns entweder aufregen oder ärgern. Manche Träume machen uns sogar Angst, und dieser Traum von mir ist nur einer der Träume, die man als aufregend bezeichnen könnte. Manche Träume gehen in Erfüllung, weil es vorherbestimmt ist, dass sie in Erfüllung gehen. Manche sind sehr interessant, aber unmöglich, weil sie vielleicht nie in Erfüllung gehen und somit auf der Ebene des Wunsches bleiben. Ironischerweise werden die 'süßen Träume' oft bevorzugt, auch wenn sie unlogisch und unmöglich sind. Es gibt jedoch bestimmte Träume, die wir schnell verbieten und einem bösen Geist oder einem bösen Omen zuschreiben. Wenn Sie einen dieser Träume erleben, machen Sie sich keine Sorgen, du befindest sich einfach im Traumland. Bei Tagesanbruch werdest du aus dem Schlaf erwachen und glücklich in unsere existentielle Welt der Realität zurückkehren." 
    },
    { 
      "title": "The Hidden World of Autism: Insights, Challenges and Triumphs", 
      "year": 2016, 
      "image": "images/hiddentruth.jpg",
      "link": "https://amzn.eu/d/g7QXjbf",
      "description": "The world of Autism Spectrum Disorder (commonly known as autism), is hidden not because it is invisible, but because either the world does not know how to see it or has not yet taken time to see it. Autistic individuals have been forced to hide behind the masks of ignorant assumptions, misdiagnosed struggles, misunderstood behaviours, and misunderstood needs. Behind these masks, shines the triumphs of unexpected talents, the glory of love, and a unique life. This book is an effort to create a more ethical and clearer understanding of autism. It is also a motivation for individuals, parents, families and organizations to listen more attentively to the challenges of the autistic individuals and take action to support the desire for integration and inclusion. Government and stakeholders must also recognise that inclusion is not a charity, it is justice. Policies must be drafted and implemented to include the wellbeing and welfare of every mind, every voice and every being." 
    },
    { 
      "title": "Transformed or Conformed, A Story of Divine Transformation", 
      "year": 2025, 
      "image": "images/transformed.jpg",
      "link": "https://amzn.eu/d/9Yj23r0",
      "description": "Every Christian is faced with two choices, to transform into a spiritual being or conform to the worldly desires. This is an age long battle that has pitched mankind in-between morality and immorality, good and bad, light and darkness, etc. The choice remains very important for either the physical or spiritual success of mankind. The story of Divine transformation is a story of ontological change that happens in the life of man. It is a change initiated by God, for God and through God. When we are faithful to the principles that guide our spiritual life and growth, we remain on the path of transformation but when we obey our passions and desires, we remain conformed to the world. Are you transformed or conformed?" 
    },
    { 
      "title": "Religion, Politics and Ethnic Games in Nigeria, from the Perspective of Christian Social Ethics (with reference to Eastern Nigeria)", 
      "year": 2023, 
      "image": "images/71FgkmtjJXL._SY522_.jpg",
      "link": "https://amzn.eu/d/gFja0kq",
      "description": "Politics affect everything that goes on in our country, in our states, in our towns, in our schools and even our churches, mosques and traditional shrines. It is relevant to note that religion respects politics and engages political authority in a symbiotic relationship. In this relationship, religion engages, respects, supports and criticizes political authority when necessary. This engagement between religion and politics has often exposed fake, selfish, and greedy religious leaders." 
    },
    { 
      "title": "Liebe Auf dem Ersten Blick: Ein Mythos oder Realität?", 
      "year": 2021, 
      "image": "images/81+RvlkfIGL._SY522_.jpg",
      "link": "https://amzn.eu/d/iSw9GG7",
      "description": "In diesem leicht zu lesenden Buch stelle ich die Frage, ob es so etwas wie Liebe auf den ersten Blick wirklich gibt, ob sie nur ein Mythos oder Realität ist. Die Liebe ist nie so einfach, wie viele denken oder glauben. Sie ist etwas komplizierter als das. Sie ist wie ein zweischneidiges Schwert, das sowohl aufbauen als auch zerstören kann, das sowohl Freude als auch unerträglichen Schmerz bereiten kann. Dieselbe Liebe, die dem Leben Sinn und Freude verleiht, hat sich auch als Ursache für Schmerz und Herzschmerz bei so vielen Menschen erwiesen. Was ist Liebe? Wo liegt sie? Was ist der Unterschied zwischen Liebe und Zuneigung? Was sind die Merkmale der wahren Liebe? Wie entwickelt und reift die Liebe? Was sind die Arten der Liebe? Das sind die Fragen, die ich zu erforschen versucht." 
    },
    { 
      "title": "Who is Asking Why? Short Reflections on Motivation, Courage, Determination and Success", 
      "year": 2022, 
      "image": "images/71hb8gfGLHL._SY522_.jpg",
      "link": "https://amzn.eu/d/5cjTOlH",
      "description": "Often, we are faced with difficult challenges, difficult decisions to make and hurdles to overcome, moments when depression seemed inevitable. In such moments, our reactions matter a lot. We can choose to be pessimists or optimists. When confronted by the same challenge, the pessimist looks for reasons why it could not be done while the optimist looks for reasons why it could be done. The simplest question by the pessimists would always be, WHY? rather than HOW? But why do we always ask why rather than the question how? There is a big difference between the two questions. The former signifies negativism while the latter signifies positivism. Negativism is worry oriented while positivism is solution oriented…. HOW IT COULD BE SOLVED!" 
    },
    { 
      "title": "The Catholic Institute for Justice, Development and Peace (CIDJAP): A Handbook on the Response of CIDJAP to the Socio-Political Failures in Integral Development Justice and Peace", 
      "year": 2024, 
      "image": "images/510ckq+eWAL._SY445_SX342_.jpg",
      "link": "https://amzn.eu/d/1EB3VmA", 
      "description": "The church has always enjoyed, a mandate to serve the poor and to protect the dignity and rights of the weak and powerless in the society. Although, history shows that the church has not always fulfilled this mandate, it is relevant to note that the duty and responsibility of serving the poor and protecting the dignity/rights of the weak is not only limited to the church and its hierarchy, but to every Christian and citizen. The birth of Catholic Institute for Development, Justice and Peace (CIDJAP) was a much-needed response to this religious and socio-political demands of the time. This handbook evaluates the efforts of CIDJAP in the integral development of people with the conviction that development is about people not things. This work would serve as a guide for integral development and help in the formation of development, justice and peace workers." 
    },
    { 
      "title": "The Integral Spiritual Meaning of Igbo Names", 
      "year": 2014, 
      "image": "images/81LWzOd+3hL._SY522_.jpg",
      "link": "https://amzn.eu/d/4YQQ7Cy",
      "description": "Names are very powerful and can serve as a positive or negative influence in one's destiny. This book gives an insight into the names of the Igbo people all over the world. The Igbo name is highly informative such that one could easily see through the names, a reflection of one’s belief or opinion on life and reality. The Igbo names serve both as windows or mirrors through which one could investigate the Igbo world values as well as their way of dealing with or understanding life. The aim of this work is to analyze a wide range of Igbo ancient and contemporary names, giving their spiritual and theological implications. I have also tried to make a compilation of the Igbo names in an alphabetical order with their meanings attached. This is intended to help the Igbo all over the world to reconnect with the cultural and traditional values as signified by the names. It also gives one an insight to the meanings of some ancient Igbo names especially those that are gradually going extinct." 
    },
    { 
      "title": "EINE KRISE DER MORAL (Konkrete, exemplarische Geschichten der Jugend in Nigeria)", 
      "year": 2022, 
      "image": "images/81Vz5my1+5L._SY522_.jpg",
      "description": "Fast immer steht man im Leben vor einem moralischen Scheideweg, vor einer Wahl und einer Entscheidung. Und die Optionen liegen immer vor uns, aus denen wir wählen können, während wir andere verwerfen. Natürlich mit den entsprechenden Konsequenzen, die sich daraus ergeben. Die Krise der Entscheidungsfindung, insbesondere wenn es um moralische Fragen geht, 'zu sein oder nicht zu sein, zu tun oder nicht zu tun', ist nicht nur auf eine bestimmte Kategorie von Menschen, wie die Jugend, beschränkt. Dieses Buch zeigt die unterschiedlichen Dynamiken der Moral und ihre subtilen Verästelungen auf. Es ist vollgepackt mit lehrreichen praktischen Geschichten, die in einer einfachen, heimatlichen Sprache vorgetragen werden, die dem Leser Lust auf mehr machen, wenn die letzte Seite längst umgeblättert ist.",
      "link": "https://amzn.eu/d/1BsnETi"
    }
  ],
  "articles": [
    { 
      "title": "The Role of Politics, Policy and Polity in the Face of Global Climate Challenges; Insights for Effective Climate Mitigation and Adaptation Actions",
      "link": "https://www.academia.edu/143416539/The_Role_of_Politics_Policy_and_Polity_in_the_Face_of_Global_Climate_Challenges_Insights_for_Effective_Climate_Mitigation_and_Adaptation_Actions?source=swp_share",
      "description": "Climate change poses a difficult challenge for humanity and the ecological system. This was first recognized at the first World Climate Conference (WCC) in 1979. 1 In 1988, an international scientific body known as the Intergovernmental Panel on Climate Change (IPCC), was established to investigate the extent and possible global impact of climate change. 2 In its first report, the IPCC called for a global treaty on climate change. This report led to the signing 6 UNFCCC (2015), Adoption of the Paris Agreement in 2015.",
      "date": "2025" 
    },
    { 
      "title": "ECONOMY AND EDUCATION AS TWO SIDES OF ANY MEANINGFUL DEVELOPMENT",
      "link": "https://www.academia.edu/36223857/ECONOMY_AND_EDUCATION_AS_TWO_SIDES_OF_ANY_MEANINGFUL_DEVELOPMENT_docx?source=swp_share",
      "description": "Education sharpens the mind, makes one reason rationally and objectively as well as projects one for greatness in life. Indeed, education opens doors and windows of opportunity. However, education must go hand in hand with economy both for the individual in particular and the state in general. Indeed, no nation can practically develop without massive investment in their educational system. This is because a country’s development is tied to the quality of its human resources. The quality of its human resources on the other hand reflects the quality of education available which directly or indirectly affects the economy of the nation." 
    },
    { 
      "title": "THE PLACE OF PRAISE AND WORSHIP IN CHRISTIAN SPIRITUAL GROWTH",
      "link": "https://www.academia.edu/40904264/THE_PLACE_OF_PRAISE_AND_WORSHIP_IN_CHRISTIAN_SPIRITUAL_GROWTH?source=swp_share",
      "description": "The simple attempt here is to find out the position occupied by praise and worship in the life of individuals, especially Christians. The word praise is not just the beautiful song that the choir sings in the church. It is not even the different beautiful styles of dancing that accompany the sonorous sound of the drums in the church, neither is it the volume of money or gifts one brings to the altar. These may be acts or expressions of praise and worship to God, but they do not define what true praise and worship is. Praise could be considered as a spirit that has the capacity of eliciting instant emotions of happiness, sorrow or fear. Praise possesses even a listener to a certain degree that could lead to emotional outburst of tears, penitence or vocal prayers. The desire of every true Christian is to attain a spiritual growth. This is achieved through constant and fervent spiritual exercises in prayer and worship. Praise and worship play a vital role in the life of every Christian. It is a sacrifice of thanksgiving (Ps.116:17). Even Jesus sang hymns with his disciples (Matthew 26:30). It is a spiritual discipline that is both an end and a means. It is an end because there is no higher goal than focusing on and praising God. It is also a means in the sense that it is a route to spiritual growth. It generates the aura of godliness.",
      "date": "2018" 
    },
    { 
      "title": "THE NIGERIAN MILITARY AND RELIGION IN POLITICS",
      "link": "https://www.academia.edu/143415956/THE_NIGERIAN_MILITARY_AND_RELIGION_IN_POLITICS_Article_?source=swp_share",
      "description": "The Military often refer to themselves as “Constitutional Caretakers” whenever they take over political power in developing societies. The army often steps in to take political action in moments of crisis, confusion or corruption that is perceived to be paralyzing the political institutions, to carry out what it believes to be “needed political reforms necessary for establishing the conditions under which political authority may eventually return to a civilian government through constitutional procedure.” This was exactly the genesis of the Military in Nigerian politics on January 15 1966. In this paper, it is my intention to analyze the genesis and characteristics of the military into the political arena of Nigeria. I shall analyze the historical journey of Nigeria through the military coups and the involvement of the military regimes in what has been called religious politicking, manipulation, meddlesomeness and acquiescence or abdication of powers and functions in the face of religious threat to the polity. I shall analyze the roles religion played in the various military regimes and how the military leaders used the religions in Nigeria as a willing tool for the satisfaction of their personal desires and ambitions." 
    },
    { 
      "title": "THE USE/MISUSE OF RELIGION IN POLITICS AND THE SOCIO-ETHICAL IMPLICATION IN NIGERIAN ELECTIONS",
      "link": "https://www.academia.edu/143603201/THE_USE_MISUSE_OF_RELIGION_IN_POLITICS_AND_THE_SOCIO_ETHICAL_IMPLICATION_IN_NIGERIAN_ELECTIONS?source=swp_share",
      "description": "This paper explores the complex relationship between religion in Nigerian. The complexity is influenced by the confusing role played by religion in Nigerian politics which has heated up debates among the polity. This is evident in the build up to the 2023 presidential elections where religion was used and misused by the politicians and their different political parties to promote their candidates and build up sentiments among the religions and their adherents. Also, the failure of leaders to show sincerity and commitment to the principles of governance has contributed to the misuse of religions as a cheap means of catching votes. These actions have far-reaching social and ethical consequences for the social coexistence, cohesion and growth of the country. The Religions in Nigeria play significant roles in the development of the nation before and after independence. Religion plays a big role in the development of education, health, economics and peaceful coexistence. It also plays the important role of promoting and sustaining harmonious relationships among different tribes and communities. Religion provides moral, psychological, social and spiritual support for authentic human and social development. This paper recommends among others: proper and extensive enlightenment on religious and social coexistence among the citizens through the curriculum of religious and civic education, equitable dispensation of social justice and amenities among all regions and tribes in Nigeria, proper regulation of all political activities and campaigns with swift consequences for defaulters who use religious sentiments to incite their supporters against other religions before, during and after the elections." 
    }
  ]
}

